Revit 2027 API
ParameterTypeId.RbsConstructionTypeShadingfactorParam Property
 "Internal Shading Factor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsConstructionTypeShadingfactorParam { get; }
Public Shared ReadOnly Property RbsConstructionTypeShadingfactorParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsConstructionTypeShadingfactorParam {
	ForgeTypeId^ get ();
}
static member RbsConstructionTypeShadingfactorParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace